{"projects" : [
    {
        "id": 1,
        "project": {
            "type": "interactive",
            "title" : "Boston Crime",
            "subTitle" : "Map",
            "role" : "Design/Development",
            "description" : "Using Boston crime data from August 2015 to January 2018, I built a visualization of the frequency of crime across Boston neighborhoods as a heat map. The visualization is based on a graduate research project using datasets from the City of Boston and Massachusetts GIS and was originally plotted in QGIS. It includes a couple of factors that have previously been shown to be influential in the literature.~Visit the live visualization |http://russomatt.com/boston-crime/*here|",
            "bg" : "img/bg-crime.jpg",
            "img" : [ "img/crime-001.jpg",
                "img/crime-002.jpg",
                "img/crime-003.jpg",
                "img/crime-004.jpg",
                "img/crime-005.jpg",
                "img/crime-006.jpg"]
        }
    },
    {
        "id": 2,
        "project": {
            "type": "interactive",
            "title" : "Drink Price",
            "subTitle" : "Calculator",
            "role" : "Design/Development",
            "description" : "A free interactive tool to help users to create and price drink recipes. They are able to create a recipe entirely from scratch or use BevSpot's pre-populated ingredients from the ingredient dropdowns. The tool is developed to be responsive and works on a wide array of screen sizes. My role in the project was heavily in user experience design and front-end development, as well as some visual design.~Visit the tool |https://app.bevspot.com/drink_price_tool/ *here| (disclaimer: if you enter your personal information to create an account you may be contacted by sales representatives)",
            "bg" : "img/bg-03.jpg",
            "img" : [ "img/dpt-001.jpg",
                "img/dpt-0001.jpg",
                "img/dpt-002.jpg",
                "img/dpt-003.jpg",
                "img/dpt-004.jpg",
                "img/dpt-005.jpg",
                "img/dpt-006.jpg"]
        }
    },

    {
        "id": 3,
        "project": {
            "type": "interactive",
            "title" : "San Francisco ",
            "subTitle" : "Visualization",
            "role" : "Design/Development",
            "description" : "A data visualization built to display tree coverage alongside data related to gentrification in an easily digestible way. The map has an interactive key to control the year of the data points. Below the map there is a breakdown of graphs per neighborhood over an adjustable time range, to allow the viewer to view trends across neighborhoods at a glance. This project was built with D3.js, Node Package Manager, and Webpack. All data that is displayed is open, public data provided by the City of San Francisco.~Visit the live visualization |http://mattrusso.github.io/*here|",
            "bg" : "img/bg-0.jpg",
            "img" : [ "img/sfdv-001.jpg",
                "img/sfdv-002.jpg",
                "img/sfdv-003.jpg"]
        }
    },
 {
        "id": 4,
        "project": {
            "type": "interactive",
            "title" : "Bar",
            "subTitle" : "Profitability Tool",
            "role" : "Design/Development",
            "description" : "A free interactive tool to help Bar Managers and Owners find out where their beverage program ranks in the United States. The user inputs three key pieces of data to receive a grade and a report containing a comprehensive analysis of their bar profitability. It provides them with BevSpot’s free resources to find ways to improve or draw them to purchase consultative services.~visit the tool |https://app.bevspot.com/bar-profit-tool/ *here| (disclaimer: do not enter your personal information in the form to avoid being contacted by sales representatives)",
            "bg" : "img/bg-2.gif",
            "img" : [ "img/bpat-001.jpg",
                "img/bpat-002.jpg",
                "img/bpat-003.jpg",
                "img/bpat-004.jpg",
                "img/bpat-005.jpg",
                "img/bpat-006.jpg",
                "img/bpat-007.jpg",
                "img/bpat-008.jpg"]

        }
    },
    {
        "id": 5,
        "project": { 
            "type": "interactive",
            "title" : "Time As",
            "subTitle" : "Color",
            "role" : "Design/Development",
            "description" : "This visualization is an attempt at representing time with color in an intuitive manner. To achieve this effect, pictures of the sky were taken at five-minute intervals and then processed to find the average RGB values for each section of a 3x3 grid. The averages are displayed in linear gradients which can show a point in time or a whole day depending on how the user chooses to view the visualization. This was part of a research project but unfortunately the hardware device which took the images was a simple webcam and not equipped to automatically adjust the white balance, resulting in images that become blown out when the sky is light.~Visit the live timeline |http://russomatt.github.io/arpb*here|",
            "bg" : "img/bg-arpb.jpg",
            "img" : [ "img/arpb-001.jpg",
                "img/arpb-002.jpg",
                "img/arpb-003.jpg"]
        }
    },   
    {
        "id": 6,
        "project": {
            "type": "interactive",
            "title" : "PostCard:",
            "subTitle" : "Social Travel App",
            "role" : "Design/Development",
            "description" : "PostCard is an app which lets one send virtual postcards to their friends and family from anywhere in the world with a tap of the finger. This app is written in Swift for iOS, and utilizes CoreLocation, MapKit, user location data and the user camera. The virtual post card provides an element of personalization that a traditional postcard cannot by  allowing the user to zoom in on the map to view and visit the exact locations that their contacts have found photo worthy.",
            "bg" : "img/bg-2.jpg",
            "img" : [ "img/pc-000.jpg",
                "img/pc-001.jpg",
                "img/pc-gif.gif",
                "img/pc-002.jpg",
                "img/pc-003.jpg"]
        }
    },
    {
        "id": 7,
        "project": { 
            "type": "interactive",
            "title" : "Greece Economic",
            "subTitle" : "Timeline",
            "role" : "Design/Development",
            "description" : "A graph displaying data and key events relating to the Greek economic crisis from 2008–2014. When a year is clicked, the graph opens up to show a timeline of events that took place within the selected year, so the viewer can infer possible driving factors behind the observed trends. ~Visit the live timeline |http://russomatt.com/greece*here|",
            "bg" : "img/bg-3.jpg",
            "img" : [ "img/greece-001.jpg",
                "img/greece-002.jpg",
                "img/greece-003.jpg",
                "img/greece-004.jpg",
                "img/greece-005.jpg"]
        }
    },   
    {
        "id": 8,
        "project": {
            "type": "interactive",
            "title" : "Profitability",
            "subTitle" : "Matrix",
            "role" : "Design/Development",
            "description" : "An interactive matrix, allowing users to see the effects on profit and sales volume by changing the sales price of a drink. This tool was built for an unreleased project and is missing content and real data. Each quadrant is color coded to represent which category the drink falls in. The top right representing the best case scenario is assigned green while the bottom left is the worst case scenario and is assigned a dark purple color. The remaining two quadrants are a sort of middle ground for drinks and are assigned two different shades of blue. The plotted point is made up of two components: the outer ring, which represents the total sales in dollars, whereas the inner circle represents the percentage of the total sales that are profit.~Visit the live site |http://russomatt.github.io/matrix.html*here|",
            "bg" : "img/bg-0000.jpg",
            "img" : [ "img/matrix-001.jpg",
                "img/matrix-002.jpg",
                "img/matrix-003.jpg",
                "img/matrix-004.jpg"]
        }
    },
    {
        "id": 9,
        "project": {
            "type": "interactive",
            "title" : "Virtual Burger",
            "subTitle" : "Exhibition",
            "role" : "Design/Development",
            "description" : "A virtual exhibition on the many different identities the hamburger assumes across the globe. I was responsible for the illustrations, the concept as well as the implementation.~Visit the live site (unfortunately it's only working in Safari and Firefox at the moment) |http://russomatt.com/yum/*here|",
            "bg" : "img/bg-4.jpg",
            "img" : [ "img/burger-001.jpg",
                "img/burger-002.jpg",
                "img/burger-003.jpg",
                "img/burger-004.jpg",
                "img/burger-005.jpg"]
        }
    },
    {
        "id": 10,
        "project": { 
            "type": "interactive",
            "title" : "Wave: Intuitive",
            "subTitle": "Communication",
            "role" : "Design/Development",
            "description" : "An intuitive communication tool that caters to users with communication impairments. The tool consists of an Arduino-powered wearable RGB LED light allowing the user to choose a color to broadcast their emotional state to their community. The LED can be set to blink fast or slow to express more complex emotions. For person-to-person communication, the user can utilize audio output dictated by gestural swipes on the iOS application. For example, if the user swipes upwards, it makes an inflated positive sound. This project is still in process, if you would like to know more feel free to contact me.",
            "bg" : "img/bg-5.jpg",
            "img" : [ "img/wave-001.gif",
                "img/wave-002.jpg",
                "img/wave-003.jpg",
                "img/wave-004.gif"]
        }
    },
    {
        "id": 11,
        "project": {
            "type": "interactive",
            "title" : "Death Rate",
            "subTitle" : "Visualization",
            "role" : "Design/Development",
            "description" : "A data visualization that illustrates the number of natural vs. nonnatural deaths in California, organized by zip code and year. It acts as a heat map where one can see the correlation of urban and rural areas with recorded death rates. It was built using d3.js, using topojson and a dataset from data.gov.~Visit the live visualization |http://russomatt.github.io/death.html*here|",
            "bg" : "img/bg-1.jpg",
            "img" : [ "img/death-001.jpg",
                "img/death-002.jpg"]
        }
    },
    {
        "id": 12,
        "project": { 
            "type": "print",
            "title" : "SF State",
            "subTitle" : "College of Business",
            "role" : "Design",
            "description" : "Rebranding of San Francisco State College of Business. We created a new wordmark and logotype, refreshed their color palette, and designed a new informational brochure. Also, we created guidelines for advertisements, web design, and mobile design.",
            "bg" : "img/bg-6.jpg",
            "img" : [ "img/sfsu-001.jpg",
                "img/sfsu-002.jpg",
                "img/sfsu-003.jpg",
                "img/sfsu-004.jpg",
                "img/sfsu-005.jpg",
                "img/sfsu-006.jpg"]
        }
    },
    {
        "id": 13,
        "project": { 
            "type": "interactive",
            "title" : "Adidas",
            "subTitle" : "Loyalty App",
            "role" : "Design",
            "description" : "I worked on various design aspects of a loyalty app targeted at users in Germany and Russia, ranging from photorealistic embroidered badges to screens for the mobile application and how they translated into a desktop setting.",
            "bg" : "img/bg-7.jpg",
            "img" : [ "img/adidas-001.jpg",
                "img/adidas-002.jpg",
                "img/adidas-003.jpg",
                "img/adidas-004.gif",
                "img/adidas-005.png"]
        }
    },

    {
        "id": 14,
        "project": { 
            "type": "print",
            "title" : "Infographics",
            "subTitle" : "",
            "role" : "Design",
            "description" : "Two examples of my student work, one showing a timeline of parallel events in the film Rashomon. I created a visual map of the four parallel story lines and a key that persists on top of the timeline to show where the stories overlap and diverge. View the |img/rashomon.pdf*pdf|.~The second depicts sexual assaults on large New England college campuses. The map and key try to draw correlation between rural and urban campuses to rates of sexual assaults, with the greater Boston area magnified in the center. There is an axis from which one can follow to quickly see which colleges fall into which ranges. View the |img/assault.pdf*pdf|",
            "bg" : "img/bg-9.jpg",
            "img" : [ "img/infographic-001.jpg",
                "img/infographic-002.jpg",
                "img/infographic-003.jpg",
                "img/infographic-004.jpg",
                "img/infographic-005.jpg",
                "img/infographic-006.jpg"]
        }
    }
]}